from telegram import Update, ReplyKeyboardMarkup
from telegram.ext import ApplicationBuilder, CommandHandler, MessageHandler, filters, ContextTypes

TOKEN = "8743703786:AAFny6Lwlu4_DfsMeSmtqtAxLEQgocQiaFU"

keyboard = [
    ["🔎 الفهرس الإلكتروني"],
    ["📚 الإطلاع على الكتب والمراجع"],
    ["🔄 خدمة الإعارة"],
    ["📸 خدمات التصوير"],
    ["👨‍🦯‍➡️ خدمات ذوي الهمم"],
    ["🧸 معمل توثيق أدب الطفل"],
    ["📖 المعمل الببليوجرافي"],
    ["🏛 المكتبة الثقافية"],
    ["💻 خدمات المعلومات"],
    ["📤 تسليم الرسائل العلمية إلكترونيًا"],
    ["📞 التواصل مع المكتبة"]
]

reply_markup = ReplyKeyboardMarkup(keyboard, resize_keyboard=True)

async def start(update: Update, context: ContextTypes.DEFAULT_TYPE):
    text = """مرحبًا بكم في 🤖 شات بوت المكتبة المركزية 📚
يسرنا خدمتكم وتقديم جميع خدمات المكتبة إلكترونيًا.
⬅ اختر الخدمة المطلوبة من القائمة 👇"""
    await update.message.reply_text(text, reply_markup=reply_markup)

async def handle_message(update: Update, context: ContextTypes.DEFAULT_TYPE):
    text = update.message.text

    if text == "🔎 الفهرس الإلكتروني":
        response = """🔎 الفهرس الإلكتروني
✔ الكتب
✔ المراجع
✔ الرسائل العلمية
✔ الدوريات

🔗 الرابط:
http://srv4.eulc.edu.eg/eulc_v5/libraries/start.aspx?ScopeID=1.22.&fn=SearchInterFace"""

    elif text == "📚 الإطلاع على الكتب والمراجع":
        response = "تتوفر قاعات متعددة حسب التخصصات الأكاديمية مع أكثر من 2000 عنوان دوري علمي."

    elif text == "🔄 خدمة الإعارة":
        response = "تشمل الإعارة الداخلية والخارجية مع نظام تجديد وغرامات تأخير."

    elif text == "📸 خدمات التصوير":
        response = "يتوفر أجهزة تصوير ضوئي وماسحات ضوئية وفق ضوابط المكتبة."

    elif text == "👨‍🦯‍➡️ خدمات ذوي الهمم":
        response = "تتوفر طابعة برايل وقاعات صوتية وأجهزة مخصصة للمكفوفين."

    elif text == "🧸 معمل توثيق أدب الطفل":
        response = "معمل متخصص لجمع وتوثيق بحوث أدب الطفل وتنظيم فعاليات ومعارض."

    elif text == "📖 المعمل الببليوجرافي":
        response = "تدريب طلاب المكتبات على التصنيف والفهرسة واستخدام الفهارس."

    elif text == "🏛 المكتبة الثقافية":
        response = "كتب ثقافية متنوعة ومجلات عامة وخدمة إحاطة جارية."

    elif text == "💻 خدمات المعلومات":
        response = "إتاحة قواعد بيانات عالمية مع دعم فني للباحثين."

    elif text == "📤 تسليم الرسائل العلمية إلكترونيًا":
        response = "رابط التسليم:\nhttps://clib.capu.edu.eg/Academic_theses/"

    elif text == "📞 التواصل مع المكتبة":
        response = """Email: central_library@hq.helwan.edu.eg
Tel: 02/28162408 (داخلي 1751)
Facebook:
https://www.facebook.com/profile.php?id=100057411760895"""

    else:
        response = "من فضلك اختاري خدمة من القائمة 👇"

    await update.message.reply_text(response)

app = ApplicationBuilder().token(TOKEN).build()

app.add_handler(CommandHandler("start", start))
app.add_handler(MessageHandler(filters.TEXT & ~filters.COMMAND, handle_message))

app.run_polling()